[
  {
    "title": "Journey",
    "isOpen": false,
    "content": [
      {
        "icon": "public",
        "subTitle": "New beginnings",
        "text": "I'm born in Sweden & moved to the US in 2017 to build a life with my wonderful partner."
      },
      {
        "icon": "diagonal_line",
        "subTitle": "Craving change",
        "text": "I started my programming journey in March 2024, after 6 years as a visual merchandiser. Since then, I've dedicated 40+ hours a week to front & back-end development."
      },
      {
        "icon": "join",
        "subTitle": "Best of two worlds",
        "text": "To me, the most stimulating aspect of programming is how it encurages both creativity & logical thinking."
      }
    ]
  },
  {
    "title": "Developer values",
    "isOpen": false,
    "content": [
      {
        "icon": "settings_accessibility",
        "subTitle": "User first",
        "text": "Creating a seamless & inclusive user experience is my top priority. I implement every application feature with user-first approach."
      },
      {
        "icon": "developer_mode",
        "subTitle": "Scalable & clean",
        "text": "I want to make life easy for fellow developers by writing clean, reusable & scalable code. The goal is to ensure that every application I build is dynamic, logical & maintainable."
      },
      {
        "icon": "school",
        "subTitle": "Never stop learning",
        "text": "Every project is a new opportunity to learn. I like going outside of my comfort zone - it keeps me motivated & helps me grow."
      }
    ]
  },
  {
    "title": "Free time",
    "isOpen": false,
    "content": [
      {
        "icon": "sailing",
        "subTitle": "Curious by nature",
        "text": "I love trying new things - whether it's tasting a dish for the first time, testing out a new JavaScript trick or randomly going on a daytrip to a place I've never been."
      },
      {
        "icon": "palette",
        "subTitle": "Inspirations",
        "text": "I am & have always been a creative person, finding inspiration in nature, art, design & the occasional thought-provoking discussion. When I'm not coding I'll be sketching, reading books, taking pictures or skiing."
      }
    ]
  }
]
